In [1]:
import pandas as pd
import numpy as np

In [9]:
df = pd.DataFrame([
    {'person':1,'salary':70000.0,'years':45},
    {'person':2,'salary':60000.0,'years':44},
    {'person':3,'salary':52000.0,'years':40}
])
df

   person   salary  years
0       1  70000.0     45
1       2  60000.0     44
2       3  52000.0     40

# Feature Scaling

## Normalisation

In [10]:
def normalise(f):
    return (df[f]-df[f].min())/(df[f].max()-df[f].min())

In [7]:
df['salary_norm'] = (df['salary']-df['salary'].min())/(df['salary'].max()-df['salary'].min())
df

   person   salary  years  salary_norm
0       1  70000.0     45     1.000000
1       2  60000.0     44     0.444444
2       3  52000.0     40     0.000000

In [15]:
df['salary_norm'] = normalise('salary')
df['years_norm'] = normalise('years')
df

   person   salary  years  salary_norm  years_norm
0       1  70000.0     45     1.000000         1.0
1       2  60000.0     44     0.444444         0.8
2       3  52000.0     40     0.000000         0.0

In [13]:
df

   person   salary  years  salary_norm
0       1  70000.0     45     1.000000
1       2  60000.0     44     0.444444
2       3  52000.0     40     0.000000